<a href="https://colab.research.google.com/github/ashkanmulla/Ashkan_Data_Science_Practice/blob/main/Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [82]:
#Series object in pandas

In [83]:
import pandas as pd

In [84]:
data = [1,2,3,4,]

In [85]:
series1 = pd.Series(data)

In [86]:
series1

0    1
1    2
2    3
3    4
dtype: int64

In [87]:
type(series1)

pandas.core.series.Series

In [88]:
#Changing the index of a series object

In [89]:
series1 = pd.Series(data, index = ["a", "b", "c,", "d"])
series1

a     1
b     2
c,    3
d     4
dtype: int64

In [90]:
#Creating a data frame using a list

In [91]:
import pandas as pd

In [92]:
data = [1,2,3,4]

In [93]:
df = pd.DataFrame(data)

In [94]:
df

   0
0  1
1  2
2  3
3  4

In [95]:
#Creating a dataframe using a dictionary

In [96]:
dictionary = {"Fruits" :["apple", "banana", "mangos"], "Count":[10,20,15]}

In [97]:
df = pd.DataFrame(dictionary)

In [98]:
df

   Fruits  Count
0   apple     10
1  banana     20
2  mangos     15

In [99]:
#Creating a dataframe using a series

In [100]:
series = pd.Series([6,12], index = ["a", "b"])
df = pd.DataFrame(series)

In [101]:
df

    0
a   6
b  12

In [102]:
#Creating a dataframe using a numpy array

In [103]:
import numpy as np

In [104]:
numpyarray = np.array([[50000,60000], ["Ashkan", "Mehjabeen"]])

In [105]:
df = pd.DataFrame({"name": numpyarray[1], "salary": numpyarray[0]})

In [106]:
df

        name salary
0     Ashkan  50000
1  Mehjabeen  60000

In [107]:
#How to perform a Merge Operation

In [108]:
import pandas as pd

In [109]:
player = ["Player1", "Player2", "Player3"]

In [110]:
point = [8,9,6]

In [111]:
title = ["Game1","Game2", "Game3"]

In [112]:
df1 = pd.DataFrame({"Player":player, "points":point, "Title":title})

In [113]:
df1

    Player  points  Title
0  Player1       8  Game1
1  Player2       9  Game2
2  Player3       6  Game3

In [114]:
player = ["Player1", "Player5", "Player6"]

In [115]:
power = ["Punch", "Kick", "Elbow"]

In [116]:
title = ["Game1", "Game5", "Game6"]

In [117]:
df2 = pd.DataFrame({"Player" :player, "Power" :power, "Title" :title})

In [118]:
df2

    Player  Power  Title
0  Player1  Punch  Game1
1  Player5   Kick  Game5
2  Player6  Elbow  Game6

In [119]:
#Inner Merge

In [120]:
df1.merge(df2, on = "Title")

  Player_x  points  Title Player_y  Power
0  Player1       8  Game1  Player1  Punch

In [121]:
#Left Merge

In [122]:
df1.merge(df2, on = "Player", how = "left")

    Player  points Title_x  Power Title_y
0  Player1       8   Game1  Punch   Game1
1  Player2       9   Game2    NaN     NaN
2  Player3       6   Game3    NaN     NaN

In [123]:
#Right Merge

In [124]:
df1.merge(df2, on = "Player", how = "right")

    Player  points Title_x  Power Title_y
0  Player1     8.0   Game1  Punch   Game1
1  Player5     NaN     NaN   Kick   Game5
2  Player6     NaN     NaN  Elbow   Game6

In [125]:
#Outer Merge

In [126]:
df1.merge(df2, on = "Player", how = "outer")

    Player  points Title_x  Power Title_y
0  Player1     8.0   Game1  Punch   Game1
1  Player2     9.0   Game2    NaN     NaN
2  Player3     6.0   Game3    NaN     NaN
3  Player5     NaN     NaN   Kick   Game5
4  Player6     NaN     NaN  Elbow   Game6

In [127]:
# How to perform join operation in pandas

In [128]:
player = ["Player1", "Player5", "Player6"]

In [129]:
power = ["Punch","Kick", "Elbow"]

In [130]:
title = ["Game1", "Game5", "Game6"]

In [131]:
df3 = pd.DataFrame({"Player" :player, "Power" :power, "Title" :title}, index = ["L1", "L2", "L3"])

In [132]:
df3

     Player  Power  Title
L1  Player1  Punch  Game1
L2  Player5   Kick  Game5
L3  Player6  Elbow  Game6

In [133]:
player = ["Player1", "Player5", "Player6"]

In [134]:
power = ["Punch","Kick", "Elbow"]

In [135]:
title = ["Game1", "Game5", "Game6"]

In [136]:
df4 = pd.DataFrame({"Players" :player, "Power" :power, "Titles" :title}, index = ["L2", "L3", "L4"])

In [137]:
df4

    Players  Power Titles
L2  Player1  Punch  Game1
L3  Player5   Kick  Game5
L4  Player6  Elbow  Game6

In [143]:
pd.concat([df3,df4])

     Player  Power  Title  Players Titles
L1  Player1  Punch  Game1      NaN    NaN
L2  Player5   Kick  Game5      NaN    NaN
L3  Player6  Elbow  Game6      NaN    NaN
L2      NaN  Punch    NaN  Player1  Game1
L3      NaN   Kick    NaN  Player5  Game5
L4      NaN  Elbow    NaN  Player6  Game6